# 1. Пользователь вводит число, Вам необходимо вывести число Пи с той точностью знаков после запятой, сколько указал пользователь

# import math

# n = int(input('Введите число n: '))
# def signs_of_pi(n):
#     p = math.pi
#     count = 0
#     for i in str(p):
#         while count <= n + 1:
#             count += 1
#             print(i, end = '')
#             break
# signs_of_pi(n)
##################################################################################################################################
# 2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N
# N = 6 | N = 12 | 32 | 13 | 9 | 18 | 21
# 2 * 3 | 2 * 2 * 3 | 2 * 2 * 2 * 2 * 2 | 13 | 3 * 3 | 2 * 3 * 3 | 3*7

# n = int(input('Введите число n: '))

# num = []
# k = 2
# m = n 
# while k * k <= n:
#         if n % k == 0:
#             num.append(k)
#             n//=k
#         else:
#             k += 1
# num.append(n)

# print(f'Cписок простых множителей числа {m} = {num}') 
##################################################################################################################################
# 3. Задайте последовательность чисел. Напишите программу, которая выведет список элементов, которые не имели повторов в исходной последовательности.
# Ввод:
# 3 1 2 3
# Вывод:
# 2 1

# from random import randint

# listnum = []
# for i in range(randint(1,30)):
#     listnum.append(randint(1,30))

# print(f'Рандомный список: {listnum}') 

# newlist = []
# for j in range(len(listnum)):
#     for k in range(len(listnum)):
#         if j !=k and listnum[j] == listnum[k]:
#             break
#     else: 
#         newlist.append(listnum[j])

# print(f'Список без одинаковых чисел: {newlist}')
##################################################################################################################################
# 4. Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и вывести многочлен степени k.
#     Пример:

# - k=2 => 2*x² + 4*x + 5 
# k = 6
#     ix^6 + ax^5 + bx^4+ cx^3 + dx^2 + ex + h
#     a, b, c, d, e, h - рандом

from random import randint

k = int(input('Введите степень К: '))

for i in range(k, 0, -1):
	ratio = randint(0, 100)
	if ratio == 0:
		continue
	elif ratio == 1:
		ratio = ''
	else:
		ratio = f'{ratio}*x^{i} + ' if i != 1 else f'{ratio}*x +'
	print(ratio, end = '')

print(f'{randint(0,100)} = 0')